In [1]:
import pandas as pd

In [14]:
#Reading the datasets and giving column names according to readme file

#Movies data
columns_m = ["Movie ID", "Title", "Genres"]

movies = pd.read_csv("movies.dat", sep="::", names=columns_m,engine="python", encoding="ISO-8859-1")

In [15]:
movies.head()

   Movie ID                               Title                        Genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [16]:
#Ratings data
columns_r = ["User ID", "Movie ID", "Rating", "Timestamp"]

ratings = pd.read_csv("ratings.dat", sep = "::", names = columns_r, engine="python", encoding = "ISO-8859-1")

In [17]:
ratings.head()

   User ID  Movie ID  Rating  Timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [18]:
#Users data
columns_u = ["User ID", "Gender", "Age", "Occupation", "Zip-Code"]

users = pd.read_csv("users.dat", sep="::", names=columns_u, engine="python", encoding="ISO-8859-1")

In [19]:
users.head()

   User ID Gender  Age  Occupation Zip-Code
0        1      F    1          10    48067
1        2      M   56          16    70072
2        3      M   25          15    55117
3        4      M   45           7    02460
4        5      M   25          20    55455

In [20]:
#Basic analysis
movies.dtypes

Movie ID     int64
Title       object
Genres      object
dtype: object

In [21]:
ratings.dtypes

User ID      int64
Movie ID     int64
Rating       int64
Timestamp    int64
dtype: object

In [22]:
users.dtypes

User ID        int64
Gender        object
Age            int64
Occupation     int64
Zip-Code      object
dtype: object

In [24]:
#Shape of the data sets
#3 columns 3883 rows
#3 features
movies.shape

(3883, 3)

In [25]:
#4 columns 1000209 rows
#4 features
ratings.shape

(1000209, 4)

In [27]:
#5 columns 6040
#4 features
users.shape

(6040, 5)